import React, {Component,Fragment} from 'react';
import classes from './Home.module.css';
import Message from './Message/Message'; 
import "animate.css/animate.min.css";
import ScrollAnimation from 'react-animate-on-scroll';
import axios from 'axios';


class Home extends Component {
    render() {
        return (
            <div className={classes.home}>
                <div className={classes.top}>
                    <div className={classes.info}>
                        <h1>كلية العلوم - قسم علوم الفلك والفضاء</h1>
                        <p>يعتبر قسم العلوم الفلكية بجامعة الملك عبدالعزيز أول قسم من نوعه بالمملكة العربية السعودية حيث تم تأسيسه ليكون أحد الأسس المهمة لمواكبة التطورات العلمية والفضائية لبناء أجيال صاعدة تتطلع إليها لتكون حاملة ورائدة لهذا العلم إن شاء الله.</p>
                        <a className={classes.action} href="#moreinfo">
                            <div className={classes.buttonleft}><h3>نبذة عامة</h3></div>
                            <div className={classes.buttonright}><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path d="M8.122 24l-4.122-4 8-8-8-8 4.122-4 11.878 12z"/></svg></div>
                        </a>
                    </div>
                </div>
                <div className={classes.message}>
                    <Message right>
                        <div className={classes.messagetitle}>
                            <h2>الرسالة</h2>
                            <div>
                            </div>
                        </div>
                        <div className={classes.messagecontent}>
                            <p>من منطلق أن قسم العلوم الفلكية هو القسم الوحيد على مستوى المملكة والثاني على مستوى الوطن العربي فإن القسم يحمل على عاتقه إعداد برامج أكاديمية متميزة ترفع المستوى العلمي لطلاب الكلية لمرحلتي البكالوريوس والماجستير والدكتوراه، ويعمل القسم على تحقيق رسالته من خلال محاور عديدة</p>
                            <ul>
                                <li>تقديم برنامج تدريسي لمرحلة البكالوريوس يتناول معظم فروع علوم الفلك والفضاء وخصوصاً الحديثة منها</li>
                                <li>تقديم برنامج الدراسات العليا يهدف إلى توسيع قاعدة البحث العلمي وإعداد وصقل كفاءات بشرية مؤهلة تأهيلاً عالياً</li>
                                <li>استخدام الطرق والتقنيات الحديثة في التدريس مع بذل أقصى جهد ممكن لرفع مستوى التحصيل العلمي والمهارات</li>
                                <li>تحديث المعامل بشكل مستمر وتدعيمها بأحدث أجهزة الرصد الفلكي وتحليل الصور والبيانات، وذلك لإثراء الجانب العلمي لدى الطالب</li>
                                <li>نشر الثقافة الفلكية عن طريق المحاضرات العامة والندوات ونشر المقالات بالصحف والمجلات وتنظيم الدورات لطلبة المراحل المدرسية المختلفة</li>
                                <li>متابعة الأحداث الفلكية السنوية وإلقاء الضوء عليها في وسائل الإعلام وتنظيم الأمسيات الفلكية في الجامعات والمدارس والجمعيات</li>
                            </ul>
                        </div>
                    </Message>
                    <Message>
                        <div className={classes.messagetitle}>
                            <h2>الرؤية</h2>
                            <div></div>
                        </div>
                        <div className={classes.messagecontent}>
                            <p>يطمح القسم إلى أن يكون واجهة علمية وتعليمية وثقافية فريدة على المستوى المحلي والإقليمي وذلك من خلال التركيز على عدد من التخصصات الفلكية الحديثة وتوثيق الصلة مع بعض المراكز العالمية ليصبح مركزاً علميا متميزاً، وأن يكون رائداً في استخدام التقنيات الفلكية الحديثة في التدريس، وأن يعمل على أن يكون منبر للإشعاع الثقافي في المجتمع.</p>
                        </div>
                    </Message>
                    <Message right>
                        <div className={classes.messagetitle}>
                            <h2>الأهداف</h2>
                            <div></div>
                        </div>
                        <div className={classes.messagecontent}>
                            <p>في مجال الأبحاث النظرية والتطبيقية</p>
                            <ul>
                                <li>تطوير وتحديث المعمل الشمسي الذي يعتبر من المعامل الفريدة على المستوى الإقليمي لملاحقة التطور السريع في مجال بحوث الفيزياء الشمسية تطوير معمل الأشعة الكونية لخدمة الأبحاث العلمية المتعلقة بالأشعة الكونية</li>
                                <li>إنشاء محطة لرصد ومتابعة الأقمار الصناعية بأشعة الليزر لتشجيع الأبحاث في مجالات الديناميكا الفضائية وحركة القشرة الأرضية ولتغيرات المناخية.</li>
                                <li>المجال التطبيقي لعلم الفلك القياسي مثل مجال المساحة الأرضية والبحرية والجوية</li>
                            </ul>
                            <p>في مجال إعداد الكوادر البشرية</p>
                            <ul>
                                <li>تخريج نخبة متميزة من طلاب البكالوريوس والماجستير والدكتوراه مزودة بالمعارف والمهارات ومؤهلة لتغطية احتياجات سوق العمل في المجالات العلمية المتخصصة في الدراسات الشمسية، الميكانيكا السماوية، علم الكون، الفلك الفيزيائي وديناميكا الفضاء</li>
                                <li>المجالات التطبيقية للأقمار الصناعية مثل تصميم ومتابعة مدارات الأقمار الصناعية المتنوعة ودراسة العوامل التي تأثر على استقرارها في مداراتها</li>
                                <li>الحساب الفلكي الشرعي مثل عمل التقاويم الفلكية وتحديد بداية الأشهر العربية وتحديد مواقيت الصلاة للبلدان المختلفة طوال العام</li>
                            </ul>
                            <p>في مجال خدمة المجتمع</p>
                            <ul>
                                <li>نشر الثقافة الفلكية عن طريق المحاضرات العامة والندوات ونشر المقالات بالصحف والمجلات وتنظيم الدورات لطلبة المراحل المدرسية المختلفة</li>
                                <li>متابعة الأحداث الفلكية السنوية وإلقاء الضوء عليها في وسائل الإعلام وتنظيم الأمسيات الفلكية في الجامعات والمدارس والجمعيات</li>
                                <li>تقديم الاستشارات العلمية لإنشاء المراصد الفلكية بالمدارس والمتاحف، والاستشارات الخاصة بمواعيد الأحداث الفلكية الهامة لكافة الهيئات بالمملكة</li>
                            </ul>
                        </div>
                    </Message>
                </div>
                <div className={classes.top} id="moreinfo">
                    <div className={classes.info}>
                    <h1>كلية العلوم - قسم علوم الفلك والفضاء</h1>
                        <p>يعتبر قسم العلوم الفلكية بجامعة الملك عبدالعزيز أول قسم من نوعه بالمملكة العربية السعودية حيث تم تأسيسه ليكون أحد الأسس المهمة لمواكبة التطورات العلمية والفضائية لبناء أجيال صاعدة تتطلع إليها لتكون حاملة ورائدة لهذا العلم إن شاء الله. وقد بدأت الدراسات الفلكية في الفصل الدراسي الثاني من عام 1396هـ كشعبة ضمن قسم الفيزياء وكانت تمنح البكالوريوس في تخصص فلك منفرد أو فلك فرعي ثم صدر قرار المجلس الأعلى للجامعات بالموافقة على إنشاء قسم العلوم الفلكية قسم مستقل ويمنح درجة البكالوريوس في التخصص المزدوج فلك/فيزياء وفلك/رياضيات. ومنذ عام 1424هـ بدأ القسم في منح درجة الماجستير بينما بدأ برنامج الدكتوراه مع بداية الفصل الأول من العام 1438/1437 ه. 
</p>
                    </div>
                </div>
            </div>
        )
    }
}

export default Home;